package b_Operation;

public class Operation_01 {
	public static void main(String[] args) {
		/*
		1. 연산자 기본
		  - 단항연산자 (-a) 
		   : ++, --, +(양수표현), -(음수표현), ~(틸트), !(not), (type)
		  
		  - 이상연산자 (a+b) 
		   : 산술연산자 => +, -, *, /, %(나머지), <<, >>, >>>(쉬프트연산자)   
		   : 비교연산자 => <, >, <=, >=, ==(=), !=(not=), instanceof
		   : 논리연산자 => &(and), |(or), ^(xor), &&(and결합), ||(or결합)
		  - 삼항연산자 (?????)
		   : ??? :
		   : 대입연산자 => =, op=
		   
		 2. 연산우선순위
		  - 단항 > 이항 > 삼항
		  - 산술연산 > 비교연산 > 논리연산 > 대입연산
		  - 단항연산자 대입연산자를 제외한 모든 연산의 진행방향은 왼쪽에서 오른쪽이다.
		 
		  
		
		 
		*/
		
		
		
		
		
		
	}
}
